# GetFabricSheetsInHost Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHostData..::..GetFabricSheetsInHost Method
RebarHostData Class See Also
---
Returns all FabricSheet elements hosted by the referenced element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IList<FabricSheet> GetFabricSheetsInHost()
```

Visual Basic
---
```text
Public Function GetFabricSheetsInHost As IList(Of FabricSheet)
```

Visual C++
---
```text
public:
IList<FabricSheet^>^ GetFabricSheetsInHost()
```

# See Also
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace